Fix diagram to Mermaid, Danny is Squad Leader
